import React from "react";
import Question from "./Question";
import "./styles.css";

const data = [
  {
    q: "यदीच्छा =?",
    o: ["यदि + इच्छा", "यदी + इच्छा", "यद् + इच्छा", "a, b उभय"],
    ra: `अ`
  },
  {
    q: "गुण संज्ञक वर्ण नास्ति",
    o: ["अ", "ए", "ओ", "अर्"],
    ra: `द`
  },
  {
    q: "“राम: +स्थाता” अस्य सन्धियुकक्त पद: भवति ?",
    o: ["रामस्स्थाता", "रामस्थाता", "राम: स्थाता", "सर्वे"],
    ra: `द`
  },
  {
    q: "किस प्रत्यय से बना पद अव्यव नहीं होता",
    o: ["क्त", "तुमून्", "क्त्वा", "ल्यप्"],
    ra: `अ`
  },
  {
    q: "ग्रह् + क्त",
    o: ["ग्रहीत:", "गृहीत:", "गृहित:", "ग्रहित:"],
    ra: `ब`
  },
  {
    q: "दा + शतृ(पुर्लिंङ्ग)",
    o: ["ददन्", "दतन्", "ददत्", "ददात्"],
    ra: `अ`
  },
  {
    q: "एध + शानच् प्रत्यय",
    o: ["एधमान:", "एधयान:", "एधान:", "एधिमान:"],
    ra: `अ`
  },
  {
    q: "जनता में प्रत्यय हैं",
    o: ["जन + तल्", "जन + तत्", "जन + तम्", "जन + तक्"],
    ra: `अ`
  },
  {
    q: "धर्म + ठक्",
    o: ["धार्मिक:", "धार्मिकं", "धर्मम्", "धर्मय"],
    ra: `अ`
  },
  {
    q: "लिख् + कत्वा इति भवति -",
    o: ["अ लिखित्वा", "ब लेखित्वा", "स लिखत्वा", "द अ, ब उभयो"],
    ra: `द`
  },
  {
    q: "निष्ठा प्रत्यय है",
    o: ["क्त", "क्तवतु", "a व् b दोनों", "क्तिन्"],
    ra: `स`
  },
  {
    q: "तिंड् प्रत्यय कितने हैं",
    o: [" 18", " 9", " 21", "  39"],
    ra: `अ`
  },
  {
    q: "निम्न में से कृत्य प्रत्यय नहीं है",
    o: ["यत्", "अनीयर्", "क्यप्", "तुमून्"],
    ra: `द`
  },
  {
    q: "शिष्य: में प्रत्यय है",
    o: ["यत्", "णयत्", "क्यप्", "क्यश्"],
    ra: `स`
  },
  {
    q: " कस्मिन् प्रत्ययात्  निर्मितं पदं अव्ययपदं नास्ति -",
    o: ["तुमुन", "क्त", "कत्वा", "ल्यप"],
    ra: `ब`
  },
  {
    q: "अट् धातु स्त्रीलिंगे शतृ प्रत्ययान्त रूपं अस्ति",
    o: ["अतंति", "अटन्ती", "अटन्ति", "सर्वे"],
    ra: `ब`
  },
  {
    q: "“ज्ञानम् अस्ति” अस्मिन अर्थे रूपं भविष्यति",
    o: ["ज्ञानवती", "ज्ञानमती", "ज्ञानवान्", "ज्ञानमान"],
    ra: `स`
  },
  {
    q: "मृजेर्वद्धि: ” इति सूत्रेण निष्पन्न रूपं अस्ति",
    o: ["मार्ग्य:", "मर्ज़:", "मृज्य:", "सर्वे"],
    ra: `अ`
  },
  {
    q: "क्तवतु “प्रत्यय कस्मिन अर्थे प्रयुक्ते -",
    o: ["भाव", "कर्म", "कर्ता", "कर्ता और कर्म"],
    ra: `स`
  },
  {
    q: "″तद् अस्य अस्ति” “तद् अस्मिन अस्ति” अर्थे प्रत्यय भवति -",
    o: ["तरप्", "मतुप्", "वतुप्", "तल्"],
    ra: `ब`
  },
  {
    q: "पा रक्षणे कत्वा प्रत्ययान्त रुपम् भविष्यति -",
    o: ["पित्वा", "पात्वा", "पांत्वा", "पीत्वा"],
    ra: `ब`
  },
  {
    q: "भ्रम् धातु कत्वा प्रत्ययान्त रूपमस्ति -",
    o: ["भ्रमित्वा", "भ्रान्त्वा", "उभयो", "भृमित्वा"],
    ra: `स`
  },
  {
    q: "वर्णानामदर्शने संज्ञा भवति ?",
    o: ["अभावः", "संयोगः", "संहिता", "लोप:"],
    ra: `द`
  },
  {
    q: "लिङ्गानुशासनं केन रचितम्",
    o: ["पाणिनिना", "कात्यायन", "पतञ्जलिः", "वरदराज"],
    ra: `अ`
  },
  {
    q: "“उरण रपर: ”सुत्रे उ: पदस्य अर्थ अस्ति ?",
    o: ["उ, ऊ", "ऋ, लृ", "इ, ई", "कोsपि नास्ति"],
    ra: `ब`
  }
];
const qNum = data.length;
const delay = (m) => new Promise((res) => setTimeout(res, m));

export default function Quiz() {
  const [current, setCurrent] = React.useState(1);
  const [score, setScore] = React.useState(0);
  const handlePrev = () => {
    delay(20).then(() => setCurrent((c) => (c !== 1 ? c - 1 : 1)));
  };
  const handleNext = () => {
    delay(20).then(() => setCurrent((c) => (c < qNum ? c + 1 : qNum)));
  };
  return (
    <div className="question-container">
      <section>
        <div className="label">
          <div>
            <p>प्रश्न {current}</p>
          </div>
        </div>
        <div className="score">
          <p>{score}/25</p>
        </div>
        <div className="slider-container">
          {data.map((val, idx) => (
            <Question key={idx} id={idx + 1} val={val} setScore={setScore} />
          ))}
        </div>
      </section>
      <section>
        <a
          href={`#question-${current - 1 < 1 ? 1 : current - 1}`}
          onMouseUp={handlePrev}
        >
          previous
        </a>
        <a
          href={`#question-${current + 1 > qNum ? qNum : current + 1}`}
          onMouseUp={handleNext}
        >
          next
        </a>
      </section>
    </div>
  );
}
